{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "If this notebook is inside a container, you will need to enable connection with the host\n",
    "\n",
    "<!-- https://forums.docker.com/t/accessing-host-machine-from-within-docker-container/14248/4 -->\n",
    "`docker network create -d bridge --subnet 192.168.0.0/24 --gateway 192.168.0.1 dockernet`\n",
    "\n",
    "`docker run -p 8888:8888 --net=dockernet  -v \"$PWD\":/home/jovyan datasci`\n",
    "\n",
    "I am also running Neo4j from a container:\n",
    "\n",
    "`docker run --publish=7474:7474 --publish=7687:7687 --volume=$HOME/neo4j/data:/data --env=NEO4J_AUTH=none neo4j`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Collecting py2neo\n",
      "Requirement already satisfied: traitlets>=4.1.0 in /opt/conda/lib/python3.6/site-packages (from py2neo) (4.3.2)\n",
      "Collecting urllib3[secure]<1.23,>=1.21.1 (from py2neo)\n",
      "  Using cached https://files.pythonhosted.org/packages/63/cb/6965947c13a94236f6d4b8223e21beb4d576dc72e8130bd7880f600839b8/urllib3-1.22-py2.py3-none-any.whl\n",
      "Collecting click>=2.0 (from py2neo)\n",
      "  Using cached https://files.pythonhosted.org/packages/fa/37/45185cb5abbc30d7257104c434fe0b07e5a195a6847506c074527aa599ec/Click-7.0-py2.py3-none-any.whl\n",
      "Requirement already satisfied: jupyter-client in /opt/conda/lib/python3.6/site-packages (from py2neo) (5.2.3)\n",
      "Collecting jupyter-console (from py2neo)\n",
      "  Using cached https://files.pythonhosted.org/packages/cb/ee/6374ae8c21b7d0847f9c3722dcdfac986b8e54fa9ad9ea66e1eb6320d2b8/jupyter_console-6.0.0-py2.py3-none-any.whl\n",
      "Requirement already satisfied: ipykernel in /opt/conda/lib/python3.6/site-packages (from py2neo) (5.1.0)\n",
      "Collecting colorama (from py2neo)\n",
      "  Using cached https://files.pythonhosted.org/packages/0a/93/6e8289231675d561d476d656c2ee3a868c1cca207e16c118d4503b25e2bf/colorama-0.4.0-py2.py3-none-any.whl\n",
      "Collecting pytest (from py2neo)\n",
      "  Using cached https://files.pythonhosted.org/packages/57/94/305477fb977546970a3464c21b63c6800df6705384af2978b89acccfb151/pytest-3.10.1-py2.py3-none-any.whl\n",
      "Requirement already satisfied: pygments>=2.0 in /opt/conda/lib/python3.6/site-packages (from py2neo) (2.2.0)\n",
      "Collecting prompt-toolkit==1.0.15 (from py2neo)\n",
      "  Using cached https://files.pythonhosted.org/packages/04/d1/c6616dd03701e7e2073f06d5c3b41b012256e42b72561f16a7bd86dd7b43/prompt_toolkit-1.0.15-py3-none-any.whl\n",
      "Collecting neo4j-driver<1.7,>=1.6 (from py2neo)\n",
      "Collecting neotime (from py2neo)\n",
      "Requirement already satisfied: ipython_genutils in /opt/conda/lib/python3.6/site-packages (from traitlets>=4.1.0->py2neo) (0.2.0)\n",
      "Requirement already satisfied: six in /opt/conda/lib/python3.6/site-packages (from traitlets>=4.1.0->py2neo) (1.11.0)\n",
      "Requirement already satisfied: decorator in /opt/conda/lib/python3.6/site-packages (from traitlets>=4.1.0->py2neo) (4.3.0)\n",
      "Requirement already satisfied: certifi; extra == \"secure\" in /opt/conda/lib/python3.6/site-packages (from urllib3[secure]<1.23,>=1.21.1->py2neo) (2018.10.15)\n",
      "Requirement already satisfied: jupyter_core in /opt/conda/lib/python3.6/site-packages (from jupyter-client->py2neo) (4.4.0)\n",
      "Requirement already satisfied: pyzmq>=13 in /opt/conda/lib/python3.6/site-packages (from jupyter-client->py2neo) (17.1.2)\n",
      "Requirement already satisfied: python-dateutil>=2.1 in /opt/conda/lib/python3.6/site-packages (from jupyter-client->py2neo) (2.7.4)\n",
      "Requirement already satisfied: tornado>=4.1 in /opt/conda/lib/python3.6/site-packages (from jupyter-client->py2neo) (5.1.1)\n",
      "Requirement already satisfied: ipython in /opt/conda/lib/python3.6/site-packages (from jupyter-console->py2neo) (7.0.1)\n",
      "Requirement already satisfied: setuptools in /opt/conda/lib/python3.6/site-packages (from pytest->py2neo) (40.4.3)\n",
      "Collecting py>=1.5.0 (from pytest->py2neo)\n",
      "  Using cached https://files.pythonhosted.org/packages/3e/c7/3da685ef117d42ac8d71af525208759742dd235f8094221fdaafcd3dba8f/py-1.7.0-py2.py3-none-any.whl\n",
      "Collecting pluggy>=0.7 (from pytest->py2neo)\n",
      "  Using cached https://files.pythonhosted.org/packages/1c/e7/017c262070af41fe251401cb0d0e1b7c38f656da634cd0c15604f1f30864/pluggy-0.8.0-py2.py3-none-any.whl\n",
      "Collecting atomicwrites>=1.0 (from pytest->py2neo)\n",
      "  Using cached https://files.pythonhosted.org/packages/3a/9a/9d878f8d885706e2530402de6417141129a943802c084238914fa6798d97/atomicwrites-1.2.1-py2.py3-none-any.whl\n",
      "Collecting attrs>=17.4.0 (from pytest->py2neo)\n",
      "  Using cached https://files.pythonhosted.org/packages/3a/e1/5f9023cc983f1a628a8c2fd051ad19e76ff7b142a0faf329336f9a62a514/attrs-18.2.0-py2.py3-none-any.whl\n",
      "Collecting more-itertools>=4.0.0 (from pytest->py2neo)\n",
      "  Using cached https://files.pythonhosted.org/packages/79/b1/eace304ef66bd7d3d8b2f78cc374b73ca03bc53664d78151e9df3b3996cc/more_itertools-4.3.0-py3-none-any.whl\n",
      "Requirement already satisfied: wcwidth in /opt/conda/lib/python3.6/site-packages (from prompt-toolkit==1.0.15->py2neo) (0.1.7)\n",
      "Requirement already satisfied: pytz in /opt/conda/lib/python3.6/site-packages (from neotime->py2neo) (2018.6)\n",
      "Requirement already satisfied: jedi>=0.10 in /opt/conda/lib/python3.6/site-packages (from ipython->jupyter-console->py2neo) (0.13.1)\n",
      "Requirement already satisfied: pickleshare in /opt/conda/lib/python3.6/site-packages (from ipython->jupyter-console->py2neo) (0.7.5)\n",
      "Requirement already satisfied: simplegeneric>0.8 in /opt/conda/lib/python3.6/site-packages (from ipython->jupyter-console->py2neo) (0.8.1)\n",
      "Requirement already satisfied: backcall in /opt/conda/lib/python3.6/site-packages (from ipython->jupyter-console->py2neo) (0.1.0)\n",
      "Requirement already satisfied: pexpect in /opt/conda/lib/python3.6/site-packages (from ipython->jupyter-console->py2neo) (4.6.0)\n",
      "Requirement already satisfied: parso>=0.3.0 in /opt/conda/lib/python3.6/site-packages (from jedi>=0.10->ipython->jupyter-console->py2neo) (0.3.1)\n",
      "Requirement already satisfied: ptyprocess>=0.5 in /opt/conda/lib/python3.6/site-packages (from pexpect->ipython->jupyter-console->py2neo) (0.6.0)\n",
      "\u001b[31mipython 7.0.1 has requirement prompt_toolkit<2.1.0,>=2.0.0, but you'll have prompt-toolkit 1.0.15 which is incompatible.\u001b[0m\n",
      "\u001b[31mjupyter-console 6.0.0 has requirement prompt-toolkit<2.1.0,>=2.0.0, but you'll have prompt-toolkit 1.0.15 which is incompatible.\u001b[0m\n",
      "\u001b[31mneo4j-driver 1.6.2 has requirement neotime==1.0.0, but you'll have neotime 1.7.1 which is incompatible.\u001b[0m\n",
      "Installing collected packages: urllib3, click, prompt-toolkit, jupyter-console, colorama, py, pluggy, atomicwrites, attrs, more-itertools, pytest, neotime, neo4j-driver, py2neo\n",
      "  Found existing installation: urllib3 1.23\n",
      "    Uninstalling urllib3-1.23:\n",
      "      Successfully uninstalled urllib3-1.23\n",
      "  Found existing installation: prompt-toolkit 2.0.6\n",
      "    Uninstalling prompt-toolkit-2.0.6:\n",
      "      Successfully uninstalled prompt-toolkit-2.0.6\n",
      "Successfully installed atomicwrites-1.2.1 attrs-18.2.0 click-7.0 colorama-0.4.0 jupyter-console-6.0.0 more-itertools-4.3.0 neo4j-driver-1.6.2 neotime-1.7.1 pluggy-0.8.0 prompt-toolkit-1.0.15 py-1.7.0 py2neo-4.1.0 pytest-3.10.1 urllib3-1.22\n"
     ]
    }
   ],
   "source": [
    "!pip install py2neo"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "https://neo4j.com/developer/docker/"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4.1.0\n"
     ]
    }
   ],
   "source": [
    "# https://py2neo.org/v4/\n",
    "import py2neo\n",
    "print(py2neo.__version__)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "from py2neo import Graph,Node,Relationship"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph =  Graph(\"http://192.168.0.1:7474/db/data/\",secure=False)\n",
    "#graph =  Graph(\"http://localhost:7474/db/data/\",bolt=False,secure=False)\n",
    "#graph =  Graph(\"http://localhost:7474/db/data/\",username='neo4j',secure=False)\n",
    "#graph =  Graph(\"http://neo4j:password@localhost:7474/db/data/\") # https://stackoverflow.com/questions/39667425/py2neo-socketerror-connection-refused-but-curl-works"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 101,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.delete_all()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 102,
   "metadata": {},
   "outputs": [],
   "source": [
    "mary = Node(\"Person\",name=\"Mary\",primary_key='name',primary_label='Person')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(:Person {name: 'Mary', primary_key: 'name', primary_label: 'Person'})"
      ]
     },
     "execution_count": 103,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "mary"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 104,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.create(mary)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 118,
   "metadata": {},
   "outputs": [],
   "source": [
    "def print_distinct_labels(graph):\n",
    "    query=\"\"\"\n",
    "    match (n)\n",
    "    return distinct labels (n)\n",
    "    \"\"\"\n",
    "\n",
    "    data = graph.run(query)\n",
    "\n",
    "    for d in data:\n",
    "        print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 119,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record labels (n)=['Person']>\n"
     ]
    }
   ],
   "source": [
    "print_distinct_labels(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 121,
   "metadata": {},
   "outputs": [],
   "source": [
    "def how_many_nodes(graph):\n",
    "    query=\"\"\"\n",
    "    match (n)\n",
    "    return count (n)\n",
    "    \"\"\"\n",
    "\n",
    "    data = graph.run(query)\n",
    "\n",
    "    for d in data:\n",
    "        print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 122,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record count (n)=1>\n"
     ]
    }
   ],
   "source": [
    "how_many_nodes(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 123,
   "metadata": {},
   "outputs": [],
   "source": [
    "def print_all_nodes(graph):\n",
    "    query=\"\"\"\n",
    "    MATCH (n) \n",
    "    RETURN n limit 100\n",
    "    \"\"\"\n",
    "\n",
    "    data = graph.run(query)\n",
    "\n",
    "    for d in data:\n",
    "        print(d)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 124,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record n=(_3:Person {name: 'Mary', primary_key: 'name', primary_label: 'Person'})>\n"
     ]
    }
   ],
   "source": [
    "print_all_nodes(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 125,
   "metadata": {},
   "outputs": [],
   "source": [
    "a = Node('Person',primary_label=\"Person\", name=\"Alice\",primary_key=5358)\n",
    "b = Node('Person',primary_label=\"Person\", name=\"Bob\",primary_key='name')\n",
    "ab = Relationship(a, \"KNOWS\", b)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 126,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "(:Person {name: 'Alice', primary_key: 5358, primary_label: 'Person'})"
      ]
     },
     "execution_count": 126,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "a"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 127,
   "metadata": {},
   "outputs": [],
   "source": [
    "graph.push(a)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 128,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "<Record n=(_3:Person {name: 'Mary', primary_key: 'name', primary_label: 'Person'})>\n"
     ]
    }
   ],
   "source": [
    "print_all_nodes(graph)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 134,
   "metadata": {},
   "outputs": [],
   "source": [
    "tx = graph.begin()\n",
    "tx.merge(a,\"Role\",\"name\") #node,label,primary key\n",
    "tx.merge(b,\"Person\",\"name\") #node,label,pirmary key\n",
    "tx.create(ab) #tx.merge(ab)\n",
    "tx.commit()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 133,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "2"
      ]
     },
     "execution_count": 133,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.evaluate(\"MATCH (a:Person) RETURN count(a)\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "https://gist.github.com/MarneeDear/f15693b799a6085de5653daf4e39a886\n",
    "\n",
    "https://neo4j.com/blog/py2neo-3-1-python-driver-neo4j/"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.6"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
